#اعدای تام یا کامل هستن که با مجموع مقسوم علیه های کوچتر از خودشون برابر هستند 
# مثل 6 28 
#برنامه ای که یک عدد از ورودی بگیره و اعداد کامل تا اون عدد رو محاسبه کند /؟



def sum(n):
    s = 0 #مجموع مقس.م علیه ها
    for i in range(1,n):
        if(n % i == 0):#اگر بخش پذیر بود یعنی باقیمانده برابر با صفر بود پس  جز مقسوم علیه ها هست
            s += i #مقسوم علیه ها یکی یک جمع میشن
    return s #جمع مقسوم علیه هارو برمیگکررداند 

    #در اینجا 6 مدنطر هست که مقسوم علیه ها ی 6 برابر است با 1و2و3
    #جمع مقسوم علیه ها 6 میشه 


def isPerfect(n):#تابع برای اینکه عدد کامل هست  یا خیر
    return(n == sum(n))
    #توی این تابع 6 بررسی میشه که ایا عدد ورودی از یک تا اون عدد عددی هست که برابر باشه با جمع مقسوم علیه های عدد به دست اومده 

    
n=int(input("Enter n:"))
for i in range(1, n + 1):
        if isPerfect(i) == True:
            print(i)
